{
    "intents": [
      {
        "tag": "greeting",
        "patterns": [
          "Hi",
          "Hey",
          "How are you doing Subhrangsu",
          "Hello Subhrangsu",
          "Hello",
          "Hi Subhrangsu"
        ],
        "responses": [
          "Hey!",
          "Hello!",
          "I'm doing well thanks for asking!"
        ]
      },
      {
        "tag": "questions",
        "patterns": [
          "Let me know your questions and I'll be happy to answer", 
          "What are your questions", 
          "Do you have any questions",
          "please let me know your questions",
          "what questions do you have",
          "please let me know any questions you have about the job search process"
        ],
        "responses": [
          "Could you tell me about the company culture, how has your time been there and is it a good workplace for young individuals to grow?",
          "Would you say that the impact is visible in a big company such as yours?"
        ]
      },
      {
        "tag": "referral",
        "patterns": [
          "I can refer you", 
          "apply with this link for my referral", 
          "I can provide you a referral",
          "I can provide you a referral if you send me your resume and req ID",
          "Can you please send me the job link which you want referral for, your first name, last name and email id, so that I can refer you",
          "I can refer you to a role if you have a req in mind",
          "If you need referral, I am happy to do it."
        ],
        "responses": [
         "Thank you so much for the offer. I'll look for relevant opportunities and get back to you."
        ]
      },
      {
        "tag": "schedule",
        "patterns": [
          "Ping me on the weekends",
          "Let's connect this weekend",
          "I will have some time over the weekend",
          "Let’s connect next week",
          "Sure, but not this week as I'm traveling this week.",
          "Sure. I’d prefer a phone call or LinkedIn chat if that’s okay with you"
        ],
        "responses": [
          "Sure! We can schedule a call/chat at your convenience"
        ]
      },
      {
        "tag": "resume",
        "patterns": [
          "Please send me your resume",
          "Send me the positions you are interested in along with your resume. I can refer",
          "Can you share the resume and link to",
          "Send me your resume when you get a chance, we can take it from there."

        ],
        "responses": [
          "I'll send you my Resume ASAP"
        ]
      },
      {
        "tag": "fail",
        "patterns": [
          "Sorry my team has no matched opening right now",
          "Hi, no openings on my team",
          "Hi, no openings on my team for this fall. Good luck with your search!"
        ],
        "responses": [
          "I understand! Thank you for your response! I'll be on the lookout for future opportunities"
        ]
      }
    ]
  }